"use strict";

class Question {
    constructor(question, answers, right)
    {
        this._question = question;
        this._answers = answers;
        this._right = right;
    }
}

let questions = [
    new Question(
        "Кто самый богатый в мире человек?",
        ["Билл Гейтс", "Джефф Безос", "Илон Маск", "Марк Цукерберг"],
        3
    ),
    new Question(
        "Какая планета самая большая в солнечной системе?",
        ["Юпитер", "Земля", "Венера", "Плутон"],
        1
    ),
    new Question(
        "Какой химический элемент самый легкий?",
        ["Уран", "Водород", "Кобальт", "Цезий"],
        2
    ),
    new Question(
        "Кто убил Таноса?",
        ["Человек паук", "Бэтмен", "Железный человек", "Супермен"],
        3
    ),
    new Question(
        "Какой из этих месяцев зимний?",
        ["Январь", "Март", "Июль", "Октябрь"],
        1
    )
]
